trade_exp/src/InformationRegisters/Б_ОшибкиПриОбмене/Б_ОшибкиПриОбмене.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a5c29ee8-5c3c-4d3d-8ff1-7d8d573a3564">
  <name>Б_ОшибкиПриОбмене</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="288385f3-f6c9-4d96-ada7-8784be90c42d">
    <name>АдресСкрипта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="3cd9d401-2180-4e88-adbd-70494d149ba7">
    <name>Сервер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="1dedc4dd-cfcb-406f-93fe-5b56803a301d">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="382a966b-2daf-4a6b-8464-835332025b9c">
    <name>Пароль</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="b9f5dc57-8d5a-4054-84f2-16eb26a81471">
    <name>ДатаДеактивацииПриПакетнойВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f123776b-5fe2-42dc-a891-efca137183c3">
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8e4c2d3d-61e8-45c9-bda1-ee648e8f7996">
    <name>ДатаФормирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="89c41200-6e59-4584-8b4b-b1ff7ddbd724">
    <name>ДатаОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/Б_ОшибкиПриОбмене/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция Б_ОшибкиПриОбмене(ПараметрыОбмена, ОжидатьЗавершенияИмпортаФайловСервером, ТипСоединения) Экспорт
	
	Если Не ПараметрыОбмена.Свойство("ОбменВручную_") Тогда
	
		МенеджерЗаписи = РегистрыСведений.Б_ОшибкиПриОбмене.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ОжидатьЗавершенияИмпортаФайловСервером = ОжидатьЗавершенияИмпортаФайловСервером;
		МенеджерЗаписи.ТипСоединения = ТипСоединения;	
		
		НастройкиПодключения = ПараметрыОбмена.НастройкиПодключения;

		МенеджерЗаписи.АдресСкрипта = НастройкиПодключения.АдресСкрипта;
		МенеджерЗаписи.Сервер = НастройкиПодключения.Сервер;
		МенеджерЗаписи.Порт = НастройкиПодключения.Порт;
		МенеджерЗаписи.Пользователь = НастройкиПодключения.Пользователь;
		МенеджерЗаписи.Пароль = НастройкиПодключения.Пароль;
		МенеджерЗаписи.ЗащищенноеСоединение = НастройкиПодключения.ЗащищенноеСоединение;
		МенеджерЗаписи.ПараметрЗапросаHTTP_ИмпортФайлаСервером = НастройкиПодключения.ПараметрЗапросаHTTP_ИмпортФайлаСервером;
		МенеджерЗаписи.ПараметрЗапросаHTTP_Инициализация = НастройкиПодключения.ПараметрЗапросаHTTP_Инициализация;
		МенеджерЗаписи.ПараметрЗапросаHTTP_ПередачаФайла = НастройкиПодключения.ПараметрЗапросаHTTP_ПередачаФайла;
		МенеджерЗаписи.ОтветСервера_ZIPРазрешен = НастройкиПодключения.ОтветСервера_ZIPРазрешен;
		МенеджерЗаписи.ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена = НастройкиПодключения.ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена;
		МенеджерЗаписи.ОтветСервера_АварийноеЗавершениеТекущейОперации = НастройкиПодключения.ОтветСервера_АварийноеЗавершениеТекущейОперации;
		МенеджерЗаписи.ОтветСервера_УспешноеЗавершениеТекущейОперации = НастройкиПодключения.ОтветСервера_УспешноеЗавершениеТекущейОперации;
		МенеджерЗаписи.ОтветСервера_ВыполнениеТекущейОперации = НастройкиПодключения.ОтветСервера_ВыполнениеТекущейОперации;
		
		МенеджерЗаписи.ВыгружатьТолькоИзменения = ПараметрыОбмена.ВыгружатьТолькоИзменения;
		МенеджерЗаписи.ДатаДеактивацииПриПакетнойВыгрузке = ПараметрыОбмена.ДатаДеактивацииПриПакетнойВыгрузке;	
		МенеджерЗаписи.ВерсияСхемы = ПараметрыОбмена.ВерсияСхемы;
		МенеджерЗаписи.ПлатформаWindows = ПараметрыОбмена.ПлатформаWindows;
		МенеджерЗаписи.ИдентификаторОбмена = ПараметрыОбмена.ИдентификаторОбмена;	
		МенеджерЗаписи.ЕстьКритичныеОшибкиВОбмене = ПараметрыОбмена.ЕстьКритичныеОшибкиВОбмене;
		МенеджерЗаписи.Ссылка = ПараметрыОбмена.Ссылка;
		МенеджерЗаписи.КодировкаФайлаЛога = ПараметрыОбмена.КодировкаФайлаЛога;
		МенеджерЗаписи.ИмяФайлаЛога = ПараметрыОбмена.ИмяФайлаЛога;
		МенеджерЗаписи.ДатаФормирования = ПараметрыОбмена.ДатаФормирования;
		
		Возврат МенеджерЗаписи;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции	

Процедура Б_ОшибкиПриОбмене_Записать(МенеджерЗаписи, ИмяКаталога, ПолноеИмяФайла, ТекстОшибки, СписокФайловДляОтправки) Экспорт
	
	Если МенеджерЗаписи <> Неопределено Тогда
		ДатаОбмена = ТекущаяДата();
		
		ИмяФайла = СтрЗаменить(ПолноеИмяФайла, ИмяКаталога + "\", "");
		КаталогДляЗаписи = "\\192.168.8.69\ит-отдел\Гумецов\Новая папка\" + Формат(ДатаОбмена, "DF=dd-MM-yyyy" + "\" + Строка(Новый УникальныйИдентификатор()));	
		Файл = КаталогДляЗаписи + "\" + ИмяФайла;
		
		СоздатьКаталог(КаталогДляЗаписи);
		СоздатьКаталог(КаталогДляЗаписи + "\files");
		КопироватьФайл(ПолноеИмяФайла, Файл);		
		
		МенеджерЗаписи.ДатаОбмена = ДатаОбмена;
		МенеджерЗаписи.ИмяКаталога = КаталогДляЗаписи;
		МенеджерЗаписи.ПолноеИмяФайла = Файл;
		МенеджерЗаписи.ТекстОшибки = ТекстОшибки;
				
		Для Каждого ТекФайл Из СписокФайловДляОтправки Цикл
			Если ТекФайл.Представление <> ИмяФайла Тогда
				КопироватьФайл(ТекФайл.Значение, КаталогДляЗаписи + "\files\" + ТекФайл.Представление);
			КонецЕсли;
		КонецЦикла;
		
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПовторитьОбменНаСервере(ТекСтр) Экспорт
	
	ПараметрыОбмена = Новый Структура;
	НастройкиПодключения = Новый Структура; 

	НастройкиПодключения.Вставить("АдресСкрипта", ТекСтр.АдресСкрипта);
	НастройкиПодключения.Вставить("Сервер", ТекСтр.Сервер);
	НастройкиПодключения.Вставить("Порт", ТекСтр.Порт);
	НастройкиПодключения.Вставить("Пользователь", ТекСтр.Пользователь);
	НастройкиПодключения.Вставить("Пароль", ТекСтр.Пароль);
	
	НастройкиПодключения.Вставить("ЗащищенноеСоединение", ТекСтр.ЗащищенноеСоединение);
	НастройкиПодключения.Вставить("ПараметрЗапросаHTTP_ИмпортФайлаСервером", ТекСтр.ПараметрЗапросаHTTP_ИмпортФайлаСервером);
	НастройкиПодключения.Вставить("ПараметрЗапросаHTTP_Инициализация", ТекСтр.ПараметрЗапросаHTTP_Инициализация);
	НастройкиПодключения.Вставить("ПараметрЗапросаHTTP_ПередачаФайла", ТекСтр.ПараметрЗапросаHTTP_ПередачаФайла);
	
	НастройкиПодключения.Вставить("ОтветСервера_ZIPРазрешен", ТекСтр.ОтветСервера_ZIPРазрешен);
	НастройкиПодключения.Вставить("ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена", ТекСтр.ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена);
	НастройкиПодключения.Вставить("ОтветСервера_АварийноеЗавершениеТекущейОперации", ТекСтр.ОтветСервера_АварийноеЗавершениеТекущейОперации);
	НастройкиПодключения.Вставить("ОтветСервера_УспешноеЗавершениеТекущейОперации", ТекСтр.ОтветСервера_УспешноеЗавершениеТекущейОперации);
	НастройкиПодключения.Вставить("ОтветСервера_ВыполнениеТекущейОперации", ТекСтр.ОтветСервера_ВыполнениеТекущейОперации);
	
	ПолучитьПрокси(НастройкиПодключения);
	ПараметрыОбмена.Вставить("НастройкиПодключения", НастройкиПодключения); 
	
	ПараметрыОбмена.Вставить("ВыгружатьТолькоИзменения", ТекСтр.ВыгружатьТолькоИзменения);
	ПараметрыОбмена.Вставить("ВерсияСхемы", ТекСтр.ВерсияСхемы);
	ПараметрыОбмена.Вставить("ПлатформаWindows", ТекСтр.ПлатформаWindows);
	ПараметрыОбмена.Вставить("ИдентификаторОбмена", ТекСтр.ИдентификаторОбмена);
	ПараметрыОбмена.Вставить("ЕстьКритичныеОшибкиВОбмене", ТекСтр.ЕстьКритичныеОшибкиВОбмене);
	ПараметрыОбмена.Вставить("Ссылка", ТекСтр.Ссылка);
	ПараметрыОбмена.Вставить("КодировкаФайлаЛога", ТекСтр.КодировкаФайлаЛога);
	ПараметрыОбмена.Вставить("ИмяФайлаЛога", ТекСтр.ИмяФайлаЛога);
	ПараметрыОбмена.Вставить("ДатаФормирования", ТекСтр.ДатаФормирования);
	ПараметрыОбмена.Вставить("ОбменВручную_", Истина);
	
	МассивПодкаталогов = Новый Массив;
	МассивПодкаталогов.Добавить("files");
	
	Если ЗначениеЗаполнено(ТекСтр.ДатаДеактивацииПриПакетнойВыгрузке) Тогда
		ПараметрыОбмена.Вставить("ДатаДеактивацииПриПакетнойВыгрузке", ТекСтр.ДатаДеактивацииПриПакетнойВыгрузке);
	Иначе
		ПараметрыОбмена.Вставить("ДатаДеактивацииПриПакетнойВыгрузке", Неопределено);
	КонецЕсли; 
	
	Результат = Б_ОбменССайтомСервер.ВыгрузитьДанныеНаСайт(
		ПараметрыОбмена, 
		ТекСтр.ИмяКаталога, 
		ТекСтр.ПолноеИмяФайла,
		МассивПодкаталогов,
		ТекСтр.ОжидатьЗавершенияИмпортаФайловСервером,
		ТекСтр.ТипСоединения);
	
КонецПроцедуры

Процедура ПолучитьПрокси(НастройкиПодключения)
	
	НастройкаПроксиСервера = ПолучениеФайловИзИнтернета.НастройкиПроксиНаСервере();
	
	Если НастройкаПроксиСервера <> Неопределено
		И НастройкаПроксиСервера["ИспользоватьПрокси"] = Ложь Тогда
		НастройкаПроксиСервера = Неопределено;
	КонецЕсли;
	
	Протокол = ?(НастройкиПодключения.ЗащищенноеСоединение, "https", "http");
	Прокси = ?(НастройкаПроксиСервера = Неопределено, Неопределено, Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьПрокси(НастройкаПроксиСервера, Протокол));
	
	НастройкиПодключения.Вставить("Прокси", Прокси);

КонецПроцедуры 

#КонецЕсли
